app/views/supplies/_form.html.erb

     <div class="col-lg-10">
       <%= f.collection_select(:car_id, Car.where("user_id = ?", current_user.id),
                                           :id, :plate, :prompt => true) %>
---
SELECT "cars".* FROM "cars" WHERE (user_id = 6)