app/controllers/cars_controller.rb

  def create
    @car = Car.new(car_params)
     @car.user_id = current_user.id
    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("plate", "model", "year", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["plate", "ewew"], ["model", "wewe"], ["year", 2000], ["created_at", 2017-02-27 02:34:03 UTC], ["updated_at", 2017-02-27 02:34:03 UTC], ["user_id", 7]]