app/controllers/supplies_controller.rb

SELECT "supplies".* FROM "supplies"
---
  def index
    @supplies = Supply.all

SELECT "supplies".* FROM "supplies"
---
def query
  @supplies = Supply.all

INSERT INTO "supplies" ("date", "gasStation", "fuel", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["date", 2017-02-26 23:36:00 UTC], ["gasStation", ""], ["fuel", ""], ["created_at", 2017-02-26 23:36:22 UTC], ["updated_at", 2017-02-26 23:36:22 UTC], ["user_id", 6]]
---
  def create
    @supply = Supply.new(supply_params)
     @supply.user_id = current_user.id

    respond_to do |format|
      if @supply.save

UPDATE "supplies" SET "gasStation" = ?, "km" = ?, "liter" = ?, "fuel" = ?, "price" = ?, "user" = ?, "updated_at" = ? WHERE "supplies"."id" = ?
---
  def update
    respond_to do |format|
      if @supply.update(supply_params)

DELETE FROM "supplies" WHERE "supplies"."id" = ?  [["id", 1]]
---
  def destroy
    @supply.destroy

SELECT  "supplies".* FROM "supplies" WHERE "supplies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_supply
      @supply = Supply.find(params[:id])